Revit 2024 API
ParameterTypeId.StructuralAttachmentStartValueElevation Property
 "Start Attachment Elevation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralAttachmentStartValueElevation { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAttachmentStartValueElevation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAttachmentStartValueElevation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace